In [1]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [2]:
import warnings
warnings.filterwarnings(action='ignore') # error 안보겠다

In [3]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [5]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [6]:
df = titanic[['age','fare']]
# df = titanic.loc[:, ['age','fare']]

df.head(2)

    age     fare
0  22.0   7.2500
1  38.0  71.2833

In [7]:
df['ten'] = 10
df.head(2)

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10

In [8]:
df['age']/df['ten']

0      2.2
1      3.8
2      2.6
3      3.5
4      3.5
      ...
886    2.7
887    1.9
888    NaN
889    2.6
890    3.2
Length: 891, dtype: float64

In [9]:
df['age']/0 # infinite

0      inf
1      inf
2      inf
3      inf
4      inf
      ...
886    inf
887    inf
888    NaN
889    inf
890    inf
Name: age, Length: 891, dtype: float64

In [10]:
# df['age'].astype('int')
df['age'] = df['age'].fillna(0).astype('int')
df['age'].head(2)

0    22
1    38
Name: age, dtype: int32

In [11]:
'''
apply : 함수와 결합

# sr로 함수 적용시 매개변수로 'sr의 원소'가 들어가고  
# 함수 적용 후 원소 리턴 시 sr로 리턴

# df로 함수 적용시 매개변수로 'df의 sr'가 원소로 들어가고 
# 함수 적용 후  sr 리턴 시 df로 리턴
'''
def add_1(n):
  # 원소를 리턴하면 sr를 리턴
  return n+10

# 열(df['age'])로 넣으면 원소 하나씩 들어감
sr1 = df['age'].apply(add_1) 
sr1

0      32
1      48
2      36
3      45
4      45
       ..
886    37
887    29
888    10
889    36
890    42
Name: age, Length: 891, dtype: int64

In [12]:
'''
Series + Number
'''
def add_2(a,b):
  return a + b

sr2 = df['age'].apply(add_2, b = 10) 
sr2
# 자리(순서)**. apply(def, ~) 
# add_2(a=1, b=2)로 하면 안됨. vs Python # def add_2(a, arg**)

0      32
1      48
2      36
3      45
4      45
       ..
886    37
887    29
888    10
889    36
890    42
Name: age, Length: 891, dtype: int64

In [13]:
'''
lambda
'''
def add_2(n):
  return n + 10

sr3 = df['age'].apply(lambda x: add_1(x))
sr3

0      32
1      48
2      36
3      45
4      45
       ..
886    37
887    29
888    10
889    36
890    42
Name: age, Length: 891, dtype: int64

In [14]:
df['age'] + 10

0      32
1      48
2      36
3      45
4      45
       ..
886    37
887    29
888    10
889    36
890    42
Name: age, Length: 891, dtype: int32

In [15]:
'''
applymap
'''
def add_2(n):
  return n + 10

# dataframe을 넣음
df = df.applymap(add_1)
df.head()

   age     fare  ten
0   32  17.2500   20
1   48  81.2833   20
2   36  17.9250   20
3   45  63.1000   20
4   45  18.0500   20

In [16]:
# 위와 같은 logic.. 중복 확인
def add_2(n):
  return n + 10

sr3 = df['age'].apply(lambda x: add_1(x))
df['ten'] = sr3
df

     age     fare  ten
0     32  17.2500   42
1     48  81.2833   58
2     36  17.9250   46
3     45  63.1000   55
4     45  18.0500   55
..   ...      ...  ...
886   37  23.0000   47
887   29  40.0000   39
888   10  33.4500   20
889   36  40.0000   46
890   42  17.7500   52

[891 rows x 3 columns]

In [17]:
# re
import numpy as np

df_1 = titanic.loc[:, ['age','fare']]

In [18]:
# df.iloc[1, 1] = np.nan
df_1.iloc[1][1] = np.nan
df_1.head(2)

    age  fare
0  22.0  7.25
1  38.0   NaN

In [19]:
def missing_value(series):
  # sr를 넣으면 df리턴
  return series.isnull() # .isna() === .isnull()

# dataframe(missing_value)를 넣게되면 sr로 들어감.
result = df_1.apply(missing_value, axis=0) 
result.head()

     age   fare
0  False  False
1  False   True
2  False  False
3  False  False
4  False  False

In [20]:
df_1.head()

    age    fare
0  22.0   7.250
1  38.0     NaN
2  26.0   7.925
3  35.0  53.100
4  35.0   8.050

In [21]:
def min_max(x):
  print(x.max())
  print(x.min())
  # 얘는 원소로 리턴 돼서 시리즈로 나온 것 -> 리턴값이 무엇이냐에 따라 값이 결정됨
  return x.max() - x.min()

# df -> sr로 들어감
result = df_1.apply(min_max) 
print()
print(result) # sr로 return 되었다.

80.0
0.42
512.3292
0.0

age      79.5800
fare    512.3292
dtype: float64

In [22]:
df_2 = titanic.loc[:, ['age','fare']]
df_2['ten'] = 10

In [23]:
df_2.head(-885)

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10
5   NaN   8.4583   10

In [24]:
def add_obj(a, b):
  return a + b

df_2['add'] = df_2.apply(lambda x: add_obj(x['age'], x['ten']), axis=1)
df_2.head()

    age     fare  ten   add
0  22.0   7.2500   10  32.0
1  38.0  71.2833   10  48.0
2  26.0   7.9250   10  36.0
3  35.0  53.1000   10  45.0
4  35.0   8.0500   10  45.0

In [25]:
df_2['add2'] = df_2['age'] + df_2['ten'] 
df_2.head()

    age     fare  ten   add  add2
0  22.0   7.2500   10  32.0  32.0
1  38.0  71.2833   10  48.0  48.0
2  26.0   7.9250   10  36.0  36.0
3  35.0  53.1000   10  45.0  45.0
4  35.0   8.0500   10  45.0  45.0

In [26]:
# pipe
# python : 재귀

In [27]:
df_3 = titanic.loc[:, ['age','fare']]

In [28]:
# df.head().sum().sum() # df -> sr -> sr의합(scalar)
df_3.isnull().sum().sum()

177

In [29]:
def missing_value(x):
    return x.isna()

def missing_count(x):
    return missing_value(x).sum()

def totoal_number_missing(x):
    return missing_count(x).sum()

In [30]:
result_df = df_3.pipe(missing_count)
result_df.head()

age     177
fare      0
dtype: int64

In [31]:
result_df = df_3.pipe(totoal_number_missing)
result_df

177

In [32]:
result_df = df_3.apply(totoal_number_missing)
result_df

age     177
fare      0
dtype: int64

In [33]:
df_4 = titanic.loc[0:4, 'survived':'age']
df_4

   survived  pclass     sex   age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [34]:
df_5 = titanic.iloc[0:5, 0:4]
df_5

   survived  pclass     sex   age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [35]:
df_5.columns ### ***중요

Index(['survived', 'pclass', 'sex', 'age'], dtype='object')

In [36]:
columns = list(df_5.columns.values) # 자주 사용하지 X
columns

['survived', 'pclass', 'sex', 'age']

In [37]:
# 자주 사용하지 X
columns_sorted = sorted(columns) # alphabet 순
df_sorted = df_5[columns_sorted]
df_sorted

# columns_sorted = reversed(columns)
# df_sorted = df_4[columns_sorted]
# df_sorted

    age  pclass     sex  survived
0  22.0       3    male         0
1  38.0       1  female         1
2  26.0       3  female         1
3  35.0       1  female         1
4  35.0       3    male         0

In [38]:
col_customed = ['pclass','sex','survived']
df_6 = df_5[col_customed] 
df_6

# df = df[['pclass','sex','survived']] 로 사용

   pclass     sex  survived
0       3    male         0
1       1  female         1
2       3  female         1
3       1  female         1
4       3    male         0

In [39]:
### 중요?

import pandas as pd

# 중복 데이터를 갖는 데이터프레임 만들기
df = pd.DataFrame({'c1':['a%aa', 'a%aa', 'b-bb', 'a-aa', 'b$bb'],
                  'c2':[[1, 1, 1], [1, 2, 2], [1, 3, 3], [2, 4, 4], [2, 5, 5]],
                  'c3':[1, 1, 2, 2, 2]})
df

     c1         c2  c3
0  a%aa  [1, 1, 1]   1
1  a%aa  [1, 2, 2]   1
2  b-bb  [1, 3, 3]   2
3  a-aa  [2, 4, 4]   2
4  b$bb  [2, 5, 5]   2

In [40]:
df['new'] = df['c1'].str.split('-')
df

     c1         c2  c3      new
0  a%aa  [1, 1, 1]   1   [a%aa]
1  a%aa  [1, 2, 2]   1   [a%aa]
2  b-bb  [1, 3, 3]   2  [b, bb]
3  a-aa  [2, 4, 4]   2  [a, aa]
4  b$bb  [2, 5, 5]   2   [b$bb]

In [41]:
df['c1'].str.rstrip('')

0    a%aa
1    a%aa
2    b-bb
3    a-aa
4    b$bb
Name: c1, dtype: object

In [42]:
df['c1'].str.find('a') # 왼쪽 기준으로 가장 첫번째 값

0    0
1    0
2   -1
3    0
4   -1
Name: c1, dtype: int64

In [43]:
df['c1'].str.upper() # lower() capitalize()

0    A%AA
1    A%AA
2    B-BB
3    A-AA
4    B$BB
Name: c1, dtype: object

In [44]:
df['1번인덱스'] = df['c2'].str.get(1) # .get() 인덱스
df

     c1         c2  c3      new  1번인덱스
0  a%aa  [1, 1, 1]   1   [a%aa]      1
1  a%aa  [1, 2, 2]   1   [a%aa]      2
2  b-bb  [1, 3, 3]   2  [b, bb]      3
3  a-aa  [2, 4, 4]   2  [a, aa]      4
4  b$bb  [2, 5, 5]   2   [b$bb]      5